package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_1_2_1_float_type_83;

/**
 * Тип float Этот тип определяет числовое значение с плавающей точкой одинарной точности,
 * для хранения которого в оперативной памяти требуется 32 бита.
 *
 * В некоторых процессорах обработка
 * числовых значений с плавающей точкой
 * одинарной точности выполняется быстрее
 * и требует в два раза меньше памяти,
 * чем обработка аналогичных значений двойной точности.
 *
 * Но если числовые значения слишком велики или слишком малы,
 * то тип данных float не обеспечивает требуемую точность вычислений.
 *
 * Этот тип данных удобен в тех случаях,
 * когда требуется числовое значение с дробной частью,
 * но без особой точности.
 *
 * Пример:
 * значение типа float может быть удобно для представления денежных сумм в долларах и центах.
 *
 *
 */
public class FloatType {
    // объявления переменных типа float.
    float hightemp, lowtemp;
}
