package ru.sectorsj.book.shild.javaguade._4_operations_110_132._4_2_1_3_bitwise_bool_or_116;

/**
 * 4.2.1.3 - Поразрядная логическая операция ИЛИ
 *
 * "|" - поразрядная логическая операции ИЛИ.
 *
 * 1) в двоичном разряде результата
 *    устанавливается 1,
 *    если соответствующий двоичный разряд
 *    в любом из операндов равен 1.
 *
 * 2) Во всех остальных случаях
 *    в двоичном разряде результата устанавливается О.
 *
 *      00101010    42
 *    | 00001111    15
 *    ----------------
 *      00101111    47
 */
public class BitwiseBooleanOR {
}
