package ru.sectorsj.book.shild.javaguade._5_control_operators_133_162._5_0_0_0_control_operators_131;

/**
 * 5.0.0.0 - Условные операторы
 *
 * В языках программирования управляющие операторы
 * применяются для:
 * 1) реализации переходов
 * 2) ветвлений в потоке исполнения команд программы,
 * исходя из ее состояния.
 *
 * В Java Управляющие операторы можно разделить
 * на 3 категории операторов:
 * 1) выбора:
 *    позволяют выбирать разные ветви выполнения команд
 *    в соответствии с результатом вычисления заданного выражения
 *    или состоянием переменной.
 * 2) цикла:
 *    позволяют повторять выполнение одного
 *    или нескольких операторов
 *    (т.е. они образуют циклы).
 * 3) перехода:
 *    обеспечивают возможность
 *    нелинейного выполнения программы.
 */
public class ControlOperators {
}
