package ru.sectorsj.javaguade._3_data_types_vars_arrays_79_109._3_1_0_0_primive_types_80;

/**
 * 1.1.0 - Примитивные типы
 *
 * В языке Java определены 8 примитивных(простых) типов данных:
 * - byte    - Целые числа
 * - short   - Целые числа
 * - int     - Целые числа
 * - long    - Целые числа
 * - float   - Числа с плавающей точкой
 * - double  - Числа с плавающей точкой
 * - char    - Символы
 * - boolean - Логические значения
 *
 *
 * Примитивные типы можно разделить на 4 группы:
 *
 * 1) Целые числа - эта группа включает в себя типы данных:
 *                  byte, short, int, long
 *                  представляющие целые числа со знаком
 *
 * 2) Числа с плавающей точкой - эта группа включает в себя типы данных float и double,
 *                               представляющие числа с точностью до определенного знака
 *                               после десятичной точки.
 *
 * 3) Символы - эта группа включает в себя тип данных char,
 *              представляющий символы, например буквы и цифры,
 *              из определенного набора.
 *
 * 4) Логические значения - эта группа включает в себя тип данных boolean,
 *                          специально предназначенный для
 *                          представления логических истинных и ложных значений.
 */
public class PrimitiveTypes {
}
