package ru.sectorsj.book.shild.javaguade._6_classes_163_184._6_4_0_0_methods_intro_170;


/**
 * 6.4.0.0 - ВВЕДЕНИЕ В МЕТОДЫ
 *
 * Классы обычно состоят из двух компонентов:
 * 1) переменные_экземпляра
 * 2) методы
 *
 * Тема методов довольно обширна,
 * поскольку в Java они получают немалые возможности и удобства.
 *
 * Для того чтобы вводить методы в классы,
 * нужно знать основные особенности методов.
 *
 * Общая форма метода:
 * Тип имя (список_параметров) {
 *     // тело метода
 * }
 *
 *
 * 1) Тип               - конкретный тип данных, возвращаемых методом.
 *                        Он может быть любым допустимым типом данных,
 *                        в том числе и типом созданного класса.
 *
 * 2) имя               - имя метода. Это может быть любой допустимый идентификатор,
 *                        кроме тех, которые уже используются другими элементами кода
 *                        в текущей области видимости.
 *
 * 3) список_параметров - обозначает последовательность пар "тип - идентификатор",
 *                        разделенных запятыми.
 *
 * 4) параметры         - это переменные, которые принимают значения аргументов,
 *                        передаваемых методу во время его вызова.
 *                        Если у метода отсутствуют параметры,
 *                        то "список_параметров" оказывается пустым.
 *
 * Если метод не возвращает значение,
 * то его возвращаемым типом должен быть void.
 *
 * Методы, возвращаемый тип которых отличается от void,
 * возвращают значение вызывающей части программы
 *
 * Форма оператора return:
 * return значение;
 *
 * 5) значение          - обозначает возвращаемое методом значение.
 *
 *
 * В дальнейшем будет показано,
 * каким образом создаются различные типы методов,
 * в том числе принимающие параметры и возвращающие значения.
 */
public class IntroToMethods {
}