package ru.sectorsj.book.shild.javaguade._5_control_operators_133_162._5_2_1_0_while_loop_140;

/**
 * 5.2.1.0 - Цикл while
 *
 * while - самый простой оператор
 *         для организации циклов в Java.
 *
 * 1) повторяет:
 *      - оператор
 *      - блок операторов
 *    до тех пор,
 *    пока значение его управляющего выражения истинно.
 *
 * Общая форма:
 *
 * while (условие) {
 *     // тело цикла
 * }
 * Параметры:
 * 1) условие - обозначает любое логическое выражение.
 *
 * 2) Тело цикла будет выполняться до тех пор,
 *    пока условное выражение истинно.
 *
 * 3) Когда условие становится ложным,
 *    управление передается строке кода,
 *    непосредственно следующей за циклом.
 *
 * 4) Если в цикле повторяется лишь один оператор,
 *    то фигурные скобки могут быть опущены
 *
 * 5) Если в начале условие цикла while
 *    при вычислении условное выражение,
 *    оказывается ложным,
 *    тело цикла не будет выполнено ни разу
 *
 *    int a = 10, b = 20;
 *    while (a > b) {
 *        // Т.к. 10 > 20 будет ложь
 *        System.out.println("Эта строка выполняться не будет.");
 *    }
 */
public class WhileLoop {
}
