package ru.sectorsj.book.shild.javaguade._4_operations_110_132._4_2_1_1_bitwise_unary_op_not_116;

    /**
     * 4.2.1.1- Поразрядная унарная операция НЕ
     *
     * "~" - это поразрядное отрицание,
     *       инвертирует все двоичные разряды
     *       своего операнда.
     *
     * Пример 1:
     * число 42, представленное в двоичной форме:
     * 00101010
     * преобразуется в результате выполнения
     * поразрядной унарной операция НЕ
     * в следующую форму:
     * 11010101
     */
public class BitwiseUnaryOpNOT {
}
