package ru.sectorsj.book.shild.javaguade._6_classes_163_184._6_1_0_0_basics_of_classes_163;

/**
 * 6.1.0.0 - Основы классов
 *
 * Классы употреблялись в примерах программ
 * едва ли не с самого начала.
 *
 * Но в приведенных до сих пор примерах демонстрировалась
 * самая примитивная форма класса.
 *
 * Классы в этих примерах служили
 * только в качестве контейнеров для метода main(),
 * который предназначался главным образом для ознакомления
 * с основами синтаксиса Java.
 *
 * Классы предоставляют значительно больше возможностей,
 * чем те, которые использовались
 * в рассматривавшихся до сих пор примерах.
 *
 *
 * 1) Класса определяет новый тип данных.
 *
 * 2) Как только этот новый тип данных будет определен,
 *    им можно воспользоваться для создания объектов данного типа.
 *
 * КЛАСС  - это шаблон для создания объекта
 * ОБЪЕКТ - это экземпляр класса
 *
 * Поскольку ОБЪЕКТ является ЭКЗЕМПЛЯРОМ класса,
 * то понятия ОБЪЕКТ и ЭКЗЕМПЛЯР употребляются в одном и том же смысле.
 */
public class BasicsOfClasses {
}