package ru.sectorsj.book.shild.javaguade._4_operations_110_132._4_1_0_0_math_operations_110;

/**
 * 4.1.0.0 - Арифметические операции
 *
 * Арифметические операции
 * применяются в математических выражениях
 * таким же образом, как и в алгебре.
 *
 * Все доступные в Java арифметические операции,
 * перечислены в табл. 4.1
 *
 * Таблица 4.1. Арифметические операции в Java
 * | Операция |                  Описание                  |
 * |----------|--------------------------------------------|
 * |   +      |  Сложение (а также унарный плюс)           |
 * |   -      |  Вычитание (а также унарный минус)         |
 * |   *      |  Умножение                                 |
 * |   /      |  Деление                                   |
 * |   %      |  Деление по модулю                         |
 * |   ++     |  Инкремент (приращение на 1)               |
 * |   +=     |  Сложение с присваиванием                  |
 * |   -=     |  Вычитание с присваиванием                 |
 * |   *=     |  Умножение с присваиванием                 |
 * |   !=     |  Деление с присваиванием                   |
 * |   %=     |  Деление по модулю с присваиванием         |
 * |   --     |  Декремент (отрицательное приращение на 1) |
 *
 * Операнды арифметических операций
 * должны иметь числовой тип.
 *
 * 1) Арифметические операции нельзя выполнять
 *    над логическими типами данных,
 * 2) Арифметические операции нельзя выполнять
 *    можно выполнять над типами данных char,
 *    т.к. в Java этот тип,
 *    является разновидностью типа int.
 */
public class ArithmeticOperations {
}
