package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_1_1_1_byte_type_82;

/**
 * 1.1.1.1 - Тип byte
 *
 * Наименьшим по длине является целочисленный тип byte.
 *
 * byte - это тип данных:
 *          - 8-разрядный
 *          - целочисленные значения со знаком
 *          - диапазон допустимых значений от -128 до 127
 *
 * Переменные типа byte удобны для работы:
 * 1) с потоками ввода-вывода данных
 * 2) в сети
 * 3) в файлах
 * 4) при работе с данными:
 *      - необработанными,
 *      - двоичными,
 *      - не совместимыми с др. встроенными типами java
 *
 * Для объявления переменных типа byte служит ключевое слово byte.
 */
public class ByteType {
    // объявления переменных типа byte
    byte a;
    byte b, c;
}
