package ru.sectorsj.book.shild.javaguade._6_classes_163_184._6_0_0_0_classes_intro_163;

/**
 * 6.0.0.0 - Введение в классы
 *
 * Класс - это элемент, образующий основу Java.
 *         Является логической конструкцией,
 *         на основе которой построен весь язык Java.
 *
 * Класс определяет:
 * - форму объекта
 * - сущность объекта
 *
 * Класс образует основу ООП на Java.
 *
 * ООП - объектно-ориентированного программирования.
 *
 * Любое понятие, которое требуется реализовать в программе на Java,
 * должно быть инкапсулировано в пределах класса.
 *
 * В главе 6 представлены:
 * - основные элементы класса
 * - поясняется, как пользоваться классом для создания объектов.
 * - методы, конструкторы и ключевое слово this.
 */
public class ClassesIntro {
}