package ru.sectorsj.book.shild.javaguade._5_control_operators_133_162._5_2_0_0_loop_operators_140;

/**
 * 5.2.0.0 - Операторы цикла
 *
 * в Java для управления циклами
 * предоставляются операторы:
 *  1) for
 *  2) while
 *  3) do-while
 *
 * Циклы - многократно выполняют один и тот же
 *         набор инструкций до тех пор,
 *         пока не будет удовлетворено
 *         условие завершения цикла.
 *
 * Операторы цикла в Java способны удовлетворить
 * любые потребности в программировании.
 */
public class LoopOperators {
}