package ru.sectorsj.book.shild.javaguade._5_control_operators_133_162._5_3_0_0_transition_operators_155;

/**
 * 5.2.4.1 - Операторы перехода
 *
 * В языке Java определены три оператора перехода:
 * 1) break
 * 2) continue
 * 3) return
 *
 * Они передают непосредственное управление
 * другой части программы.
 *
 * ВАЖНО!
 * Кроме операторов перехода,
 * в Java поддерживается еще 1 способ изменения
 * порядка выполнения инструкций программы,
 * который состоит в обработке исключений.
 *
 * Обработка исключений - предоставляет структурированный механизм,
 *                        с помощью которого можно:
 *                        - обнаруживать ошибки
 *                        - обрабатывать ошибки
 *                        во время выполнения программы (глава 10).
 *
 * Для поддержки механизма обработка исключений
 * служат ключевые слова:
 *  - try
 *  - catch
 *  - throws
 *  - finally
 *
 * Механизм обработки исключений позволяет
 * выполнять нелокальные ветви программы.
 *
 */
public class TransitionOperators {
}