package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_1_2_0_floating_point_nums_83;

/**
 * 1.1.2.0 - Числа с плавающей точкой
 *
 * Числа с плавающей точкой (действительными),
 * используются при вычислении выражений,
 * которые требуют результата с точностью
 * до определенного знака после десятичной точки.
 *
 * Примеры:
 * - Вычисление квадратного корня
 * - Вычисление трансцендентных функций:
 *      - sin
 *      - cos
 *   что приводит к результату, который требует
 *   применения числового типа с плавающей точкой.
 *
 * В языке Java реализован стандартный,
 * в соответствии с нормой IEEE-754,
 * ряд типов и операций над числами с плавающей точкой.
 *
 * Существуют 2 числовых типа с плавающей точкой:
 * - float
 * - double
 * которые представляют числа одинарной и двойной точности.
 *
 * Их длина и диапазон допустимых значений приведены в таблице 3.2
 *
 * <h3>Таблица 3.2 Длина и диапазон допустимых значений числовых типов с плавающей точкой</h3>
 * <h4> | Наименование | Длина в битах | Диапазон допустимых значений | </h4>
 * <h4> |    double    |       64      |   от 4.9е-324 до 1.8е+308    | </h4>
 * <h4> |    float     |       32      |   от 1.4е-045 до з.4е+ОЗ8    | </h4>
 */
public class FloatPointNums {
}
