package ru.sectorsj.book.shild.javaguade._6_classes_163_184._6_6_1_0_hide_instance_vars_intro_180;

/**
 * 6.6.1.0 - СОКРЫТИЕ ПЕРЕМЕННЫХ ЭКЗЕМПЛЯРА
 *
 * Сокрытие переменных экземпляра - это когда имя локальной переменной
 *                                  совпадает с именем переменной экземпляра.
 *
 * В Java не допускается:
 *  1) объявление двух локальных переменных,
 *  2) с одним и тем же именем в:
 *      - той же самой области видимости
 *      - объемлющей области видимости
 *
 * В Java допускается:
 *  1) существование локальных переменных,
 *     - включая и формальные параметры методов,
 * имена которых совпадают
 * с именами переменных экземпляра класса.
 *
 */
public class HideInstanceVars {
}