package ru.sectorsj.javaguade._3_data_types_vars_arrays_79_109._3_0_0_0_data_typing_80;

/**
 3.0.0.0 - Типы данных, переменные и массивы

    Java - строго типизированный язык

    Именно этим объясняется:
         - безопасность
         - надежность
    программ на Java.

    1) все переменные и выражения имеют конкретный тип,
       и каждый тип строго определен.

    2) все операции присваивания,
       как явные, так и через параметры,
       передаваемые при вызове методов,
       проверяются на соответствие типов.

    В языке Java отсутствуют
    средства автоматического приведения
                 или
    преобразования конфликтующих типов,
    как это имеет место в некоторых языках программирования.

    Компилятор Java проверяет все выражения
    и параметры на соответствие типов.

    Любые несоответствия типов считаются ошибками,
    которые должны быть исправлены до завершения компиляции класса.
 */
public class DataTyping {
}
