package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_5_0_0_arrays_99;

/**
 * 3.5.0.0 - Массивы
 *
 * Массив - это группа однотипных переменных,
 *          для обращения к которым
 *          используется общее имя.
 *
 * 1) Допускается создание массивов:
 *    - любого типа
 *    - разной размерности.
 *
 * 2) Доступ к конкретному элементу массива
 *    осуществляется по его индексу.
 *
 * 3) Удобный способ группирования
 *    связанной вместе информации.
 */
public class Arrays {
}
