package ru.sectorsj.book.shild.javaguade._4_operations_110_132._4_0_0_0_operations_110;

/**
 * 4.0.0.0 - Операции
 *
 * В языке Java поддерживается обширный ряд операций.
 * Большинство из них
 * может быть отнесено
 * к одной из следующих четырех групп:
 * - арифметические
 * - поразрядные
 * - логические
 * - отношения
 *
 * В языке Java также определен
 * ряд дополнительных операций
 * для особых случаев.
 *
 * В 4 главе описаны все доступные в Java операции,
 * за исключением операции сравнения типов
 * - instanceof (глава 13)
 * - операции-стрелки (лямбда -) (глава 15)
 */
public class Operations {
}
