package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_1_4_0_booleans_86;


/**
 * 3.1.4.0 - Логические значения
 *
 * В языке Java имеется примитивный тип boolean,
 * предназначенный для хранения логических значений.
 *
 * Переменные этого типа могут принимать
 * только одно из двух возможных значений:
 *  - true (истинное)
 *  - false (ложное)
 * Значения этого логического типа
 * возвращаются из всех операций сравнения:
 *  - вроде a < b.
 *
 * Тип boolean обязателен для употребления
 * и в условных выражениях,
 * которые управляют такими операторами, как:
 *  - if
 *  - for
 */
public class Booleans {
    boolean a;
    boolean b, c;
}