package ru.sectorsj.book.shild.javaguade._4_operations_110_132._4_2_1_0_bitwise_logic_operations_116;

/**
 * 4.2.1.0 - Поразрядные логические операции
 *
 * Поразрядными логическими являются операции:
 *  1) "&"
 *  2) "|"
 *  3) "^"
 *  4) "~"
 *
 * Результаты выполнения каждой
 * из этих операций приведены в табл. 4.3.
 *
 *
 * ВАЖНО!
 * Следует помнить, что
 * поразрядные логические операции выполняются:
 * а) отдельно
 * б) над каждым двоичным разрядом
 * в) каждого операнда.
 *
 *
 * Таблица 4.3. Результаты выполнения поразрядных логических операций
 *
 * |   A   |   B   |  A|B  |  A&B  |  A^B  |  ~A   |
 * |-------|-------|-------|-------|-------|-------|
 * |   0   |   0   |   0   |   0   |   0   |   1   |
 * |   1   |   0   |   1   |   0   |   1   |   0   |
 * |   0   |   1   |   1   |   0   |   1   |   1   |
 * |   1   |   1   |   1   |   1   |   0   |   0   |
 *
 */
public class BitWiseLogicOp {
}

