package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_5_2_0_multi_dimensional_arrays_102;

/**
 * 3.5.2.0 - Многомерные массивы. Общее
 *
 * В языке Java многомерные массивы
 * представляют собой массивы массивов.
 *
 * При объявлении переменной многомерного массива
 * для указания каждого дополнительного индекса
 * используется отдельный ряд квадратных скобок.
 *
 * Пример 1:
 * объявляется переменная двухмерного массива
 * twoD: int twoD[][] = new int[4][5];
 *
 * Резервируется память для массива
 * размерностью 4х5,
 * который присваивается переменной twoD.
 *
 * Эта матрица реализована внутренним образом
 * как массив массивов значений типа int.
 *
 * Схематическое изображение массива (рис. 3.1)
 */

public class MultiDimensionalArrays {
    // Пример 1:
    // Объявление переменной 2-мерного массива
    int twoD[][] = new int[4][5];
}





