package ru.sectorsj.book.shild.javaguade._4_operations_110_132._4_2_1_2_bitwise_bool_and_116;

/**
 * 4.2.1.2 - Поразрядная логическая операция И
 *
 * "&" - поразрядная логическая операции И.
 *
 * 1) в двоичном разряде результата
 *    устанавливается 1 лишь в том случае,
 *    если соответствующие двоичные разряды
 *    в операндах также равны 1.
 *
 * 2) Во всех остальных случаях
 *    в двоичном разряде результата устанавливается О.
 *
 *      00101010    42
 *    & 00001111    15
 *    ----------------
 *      00001010    10
 */
public class BitwiseBooleanAND {
}
