package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_2_3_0_logic_literals_89;

/**
 * 3.2.3.0 - Логические литералы
 *
 * Эти литералы очень просты.
 *
 * Тип boolean может иметь
 * только два логических значения:
 * - true
 * - false
 *
 * Эти значения не преобразуются ни в одно из числовых представлений.
 *
 * В языке Java логический:
 * - литерал true не равен 1,
 * - литерал false равен О.
 *
 * Логические литералы в Java
 * могут присваиваться только тем переменным,
 * которые объявлены как boolean,
 * или употребляться в выражениях с логическими операциями.
 */
public class LogicLiterals {
}
