package ru.sectorsj.book.shild.javaguade._3_data_types_vars_arrays_79_109._3_4_0_0_type_conversion_casting_95;

/**
 * 3.4.0.0 - Преобразование и приведение типов
 *
 * В Java существует:
 * 1) автоматическое преобразование (неявное):
 *
 *    а) Переменной одного типа
 *       нередко приходится присваивать
 *       значение другого типа.
 *
 *    б) Если оба типа данных совместимы,
 *       их преобразование будет выполнено в Java автоматически.
 *
 *    Пример 1:
 *    значение типа int всегда можно
 *    присвоить переменной типа long.
 *
 * ВАЖНО!
 * Не все типы данных совместимы,
 * а следовательно,
 * не все преобразования
 * типов разрешены неявно.
 *
 * 2) приведение типов (явное):
 *
 *    а) можно выполнить преобразования
 *       между несовместимыми типами
 *
 *    б) это явное преобразование несовместимых типов.
 *
 *    Пример 2:
 *    не существует автоматического преобразования
 *    типа double в тип byte.
 */
public class TypeConverceCast {
}
